[
  {
    "id": "10",
    "year": "June 2000",
    "type": "image",
    "video": "",
    "title": "June 2000<br />Mighty 4<br />Palo Alto, CA",
    "name": "Mighty 4<br />Palo Alto, CA",
    "original": "",
    "description": "Mighty 4 was one of California's biggest b-boy events, and this was not just RoxRite's first, but his first as a member of San Francisco's Renegade Rockers (established in 1983). \"That was a really good night for me,\" RoxRite recalls. \"It was a highlight moment to be able to represent with Renegades for the first time officially.\" The Renegades had been largely inactive for a couple of years, and RoxRite was the new blood. \"He was like the resurgence of our group again,\" says Politix, \"and the newest member that kind of sparked everything from there. It sparked RoxRite [to] get down with Kid David [and] Iron Monkey. We all just became close and like a family; everything just worked. RoxRite was a very important part of our history.\" (June 2000)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/010-t.gif",
    "src": "images/artwork-opt/010.gif"
  },
  {
    "id": "13",
    "year": "November 2000",
    "type": "video",
    "video": "",
    "title": "November 2000<br />Mighty 4 Appreciation Day<br />Palo Alto, CA",
    "name": "Mighty 4 Appreciation Day<br />Palo Alto, CA",
    "original": "https://www.instagram.com/p/Bgg7-1OHgm3/?taken-by=redbullmusic",
    "description": "In the solo competition of Mighty 4 Appreciation Day, RoxRite came up against a b-boy whose influence was already being felt in the culture and still is today. \"I battled Ruen,\" he explains, \"who was the guy that helped innovate air power moves in breaking. He based a style on power, and he innovated a lot of air power combinations. In my eyes, he was one of the the first to really do many variations of that move, and many people today do what he was doing back in 2000, 2001.\" Beating Ruen wasn’t easy. \"He was pretty fucking hard,\" RoxRite admits. \"I beat him there, and I was kinda like ‘whoa.’ I think he tired himself out from battling guys in the cypher a few hours earlier!\" (November 2000)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/013-t.gif",
    "src": "images/artwork-opt/013.gif"
  },
  {
    "id": "20",
    "year": "December 2002",
    "type": "video",
    "video": "-tfAlTOGvtg",
    "title": "December 2002<br />Street Legends<br />Sacramento, CA",
    "name": "Street Legends<br />Sacramento, CA",
    "original": "https://www.instagram.com/p/BgOrLvcnzo9/",
    "description": "It was a one-on-one,\" said RoxRite, \"and we didn't know who was going to be in it. We went out there and it was a crazy storm; we were driving around Sacramento and it was pouring heavily. It looked like the venue was right there, it was this weird-looking place. We drive into the parking lot—it was underneath the building. RoxRite ended up battling future BC One champ Omar in the finals. \"I always knew RoxRite was really good,\" Omar would say later. \"Matter of fact, even at that time, RoxRite was really underrated.\" (December 2002)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/020-t.gif",
    "src": "images/artwork-opt/020.gif"
  },
  {
    "id": "22",
    "year": "March 2003",
    "type": "image",
    "video": "",
    "title": "March 2003<br />Octagon<br />San Jose, CA",
    "name": "Octagon<br />San Jose, CA",
    "original": "https://www.facebook.com/redbull/videos/2063022347273616/",
    "description": "Alien Ness, head of the Mighty Zulu Kingz, conceived of this concept battle. \"The concept is to break in a small environment,\" RoxRite explains. \"The first one that he had was- I think it was maybe five by five or six by six.\" RoxRite was uniquely prepared for that kind of confinement. \"So in my living room, where I actually developed a lot of my moves, I probably had that much space, not that big. I'd be breaking in a space like that, so the octagon is like you breaking in your own living room, but what he does is he gets cones and puts caution tape around it. That was the first time that they ever had that event, and I battled my crew member Wicket in the finals against another guy; it was a three-way final. It was a long fucking tournament.\" A personal milestone was also achieved that weekend. \"The weekend of the Octagon, I also got fired from Trader Joe's, which was the best thing that ever happened. Fuck that place.\" (March 2003)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/022-t.gif",
    "src": "images/artwork-opt/022.gif"
  },
  {
    "id": "26",
    "year": "October 2003",
    "type": "video",
    "video": "7ewi93a2peI",
    "title": "October 2003<br />Bboy Masters Pro-Am<br />Toulouse, France",
    "name": "Bboy Masters Pro-Am<br />Toulouse, France",
    "original": "https://www.facebook.com/roxrite95/videos/1598555396924610/",
    "description": "\"Up to that point,\" RoxRite says, \"I hadn't gotten to really travel abroad. It felt like something that I was waiting for. All these guys that hadn't even been on yet were already traveling abroad and doing all these events, and I had missed a few opportunities of going abroad because I had issues with my parents. They still didn't support what I did 100%. To them I should’ve been going to school, getting a job and going to college and that’s it. So for a while it was a constant back and forth. We’d fight a lot. They didn’t like that I’d go at night and go to clubs and show up later and come back late, living under their roof.\" His parents threatened to kick him out of the house if he went abroad to dance, and RoxRite couldn’t yet afford to move out. \"It’s funny,\" he recalls, \"because I was making as much as they were when I started doing it professionally. ‘You guys work every day and you’re miserable.’ I don’t wanna be miserable!\" When his grandfather’s health deteriorated, his parents were suddenly too overloaded to protest: \"they were like, ‘whatever, do what you want.’\" So RoxRite headed out to Toulouse to battle, but his ailing grandfather stayed on his mind. \"I ended up winning the solo category, and that was my first international event. It was something that I was waiting for, but even after I won...\" He found out that his new freedom, and his biggest victory to date, came with a cost. \"Yeah, I won this, but I also lost my grandfather. It’s a win that is important in my career but it was overshadowed by his passing. I never got to see him again. So it takes away from it a bit.\" (October 2003)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/026-t.gif",
    "src": "images/artwork-opt/026.gif"
  },
  {
    "id": "40",
    "year": "May 2006",
    "type": "image",
    "video": "",
    "title": "May 2006<br />Ashes 2 Ashes King of the Hill<br />Portland, OR",
    "name": "Ashes 2 Ashes King of the Hill<br />Portland, OR",
    "original": "https://www.facebook.com/roxrite95/photos/a.134773246636173.26740.134542866659211/1572618539518296/?type=3&theater",
    "description": "\"The King of the Hill from 2006, that had a lineup for guys that become future world champions,\" says RoxRite. \"They had El Nino, Louie G, me, Ruen. They had a lineup—there was at least six, seven guys that would become legendary in breaking.\" (May 2006)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/040-t.gif",
    "src": "images/artwork-opt/040.gif"
  },
  {
    "id": "44",
    "year": "July 2006",
    "type": "image",
    "video": "",
    "title": "July 2006<br />Hip-Hop Intl. World Battle<br />Los Angeles, CA",
    "name": "Hip-Hop Intl. World Battle<br />Los Angeles, CA",
    "original": "https://www.instagram.com/p/BgUUIaxBabN/?taken-by=redbull\n",
    "description": "\"This event is where we started venturing out and battling alongside other crews,\" RoxRite said, \"specifically Unique Styles from Florida. This battle had a lot of international crews; we took home the title and a new allegiance emerged.\" This would be the first time the crews would team up as Unique Renegades, but not the last. (July 2006)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/044-t.gif",
    "src": "images/artwork-opt/044.gif"
  },
  {
    "id": "54",
    "year": "January 2008",
    "type": "video",
    "video": "rAXYDgDGI6Q",
    "title": "January 2008<br />Wreck Room 6<br />Columbus, Ohio",
    "name": "Wreck Room 6<br />Columbus, Ohio",
    "original": "https://twitter.com/redbullbcone/status/980444945134780417",
    "description": "It was a small 3 on 3 battle in the middle of Ohio, but the real battle turned out to be an unexpected one. \"We went to Columbus, Ohio to compete,\" RoxRite said. \"We went to get breakfast before the battle, and they wouldn't serve us. They watched us walk in, sat us down—and then after that, they just ignored us, and served everybody else around us. They never came back to us; nothing, no concern. But the moment we got up, they're like, ‘oh you gotta pay for that.’ We're just like, ‘here's your $3 for this juice my friend grabbed’ and walked out. We were the only brown people in the whole restaurant. I never really experienced that abroad that I can remember.\" (January 2008)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/054-t.gif",
    "src": "images/artwork-opt/054.gif"
  },
  {
    "id": "62",
    "year": "March 2009",
    "type": "Playlist",
    "video": "",
    "title": "March 2009<br />Hope Anniversary<br />Los Angeles, CA",
    "name": "Hope Anniversary<br />Los Angeles, CA",
    "original": "",
    "description": "Squadron battled Sacramento’s Underground Flow, one of whose members (Dylan) the Renegades once tried to recruit. \"We got David around the same time,\" RoxRite recalled. \"We were trying to recruit the next best guys in the Bay because that’s what happened with us when I got recruited into Renegades. [They were] looking for all the best guys that were young and up and coming.\" This local event was also RoxRite’s first battle as a SoCal resident. \"I’m from the Bay,\" he says, \"but LA has played a big role in breaking in general.\" RoxRite defined the stylistic differences between regions: \"LA has always been recognized more for having power heads, guys that do more spinning moves. The Bay has always been in doing stuff that’s more innovative in terms of creative transitions and having a style and individual approach. So that’s the difference. LA has a lot of power heads but then the Bay is more individual [with] influential styles, movements, or ideas.\" (March 2009)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/062-t.gif",
    "src": "images/artwork-opt/062.gif"
  },
  {
    "id": "65",
    "year": "November 2009",
    "type": "video",
    "video": "",
    "title": "November 2009<br />Claws Out 4<br />Los Angeles, CA",
    "name": "Harikoro 10-year anniversary<br />Houston, TX",
    "original": "https://www.instagram.com/p/BhWsPzxgpQO/?taken-by=redbullbcone",
    "description": "Squadron returns to Claws Out to defend their title from the year prior, battling Montreal’s Boogie Bratz. In that final round, RoxRite faces off with the legendary K-Mel in what appeared to be a heated battle. \"He's considered one of the greatest of all time,\" RoxRite says. \"He was one of the illest beat boys, the one that innovated the whole idea of hitting beats. He's one of those battlers that just has energy and is very explosive and can outperform you, like easy.\" If you watch the video of this battle on YouTube, you’ll get a glimpse of what \"Angry RoxRite\" at his best is capable of: \"I jump out and in the middle, I had a minor slip up in my round—and in the middle of that slip up and getting out of it, the song changed. And I changed with the whole song. And I just hit everything to the song, it was crazy. I ended up doing some moves and some freestyle stuff that people hadn't seen, so you could see that people were like, ‘whoa, shit!’ Then, I got up in his face and I was like, ‘that's how you drop a round.’\" The footage of this battle rightfully boosted RoxRite’s notoriety once again. (November 2009)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/065-t.gif",
    "src": "images/artwork-opt/065.gif"
  },
  {
    "id": "73",
    "year": "September 2010",
    "type": "image",
    "video": "",
    "title": "September 2010<br />All The Way Live<br />Fremont, CA",
    "name": "All The Way Live<br />Fremont, CA",
    "original": "",
    "description": "In an uncommon show of force, the entire Renegades crew entered All The Way Live. \"The main guys that are established in our scene and are part of our crew, we're so scattered that it's hard to catch all of us at once\", explains RoxRite \"To have Iron Monkey, me, Nitron, and Wicket in one squad to battle is very rare.\" (September 2010)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/073-t.gif",
    "src": "images/artwork-opt/073.gif"
  },
  {
    "id": "75",
    "year": "March 2011",
    "type": "image",
    "video": "",
    "title": "March 2011<br />Circles<br />Madison, VA",
    "name": "Circles<br />Madison, VA",
    "original": "",
    "description": "After a three-month break from breaking, during which RoxRite found more opportunities to teach and tour, he suited up for battle once again with Squadron. \"We went into this battle,\" says RoxRite, \"with our newest Squadron member Squid Rock\"—beating out New York crew Beast Coast in the finals. (March 2011)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/075-t.gif",
    "src": "images/artwork-opt/075.gif"
  },
  {
    "id": "76",
    "year": "June 2011",
    "type": "Image (bulletin feature)",
    "video": "",
    "title": "June 2011<br />Six<br />Tampa Bay, FL",
    "name": "Six<br />Tampa Bay, FL",
    "original": "",
    "description": "The seamless chemistry RoxRite always has with his two-on-two partners is well-known. RoxRite returned to this event, this time with partner Nasty Ray, and battled some of Florida's toughest duos. \"Having chemistry with another person is really important to being able to take battles such as this,\" says RoxRite. \"Talent is needed but you still need to be able to work together and understand each other's strengths and weaknesses.\" (June 2011)\n",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/076-t.gif",
    "src": "images/artwork-opt/076.gif"
  },
  {
    "id": "77",
    "year": "November 2011",
    "type": "image",
    "video": "",
    "title": "November 2011<br />Red Bull BC One<br />Moscow, Russia",
    "name": "Red Bull BC One<br />Moscow, Russia",
    "original": "http://www.okayplayer.com/originals/omar-roxrite-delgado-macias-red-bull-interview.html",
    "description": "RoxRite closed out 2011 in a major way; his solo win at the 2011 BC One was not just a true test of his individual skill, it was a real milestone in his career, one he'd been aching to check off his list. \"I'd won two B-Boy of the Year Awards at this point, had won almost every major event. The one that was missing from my list was the BC One. I walked as the oldest competitor, and at a time when i had adjusted to mainly battling in crew battles, I changed and committed to doing it (solo) again. It was the biggest title to win, and meant that I had UK Champs, R16, and BC One all under my belt. I was one of the first to win three major events.\" (November 2011)\n",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/077-t.gif",
    "src": "images/artwork-opt/077.gif"
  },
  {
    "id": "79",
    "year": "March 2012",
    "type": "Playlist",
    "video": "",
    "title": "March 2012<br />Adidas Original: Rock the Floor<br />Warsaw, Poland",
    "name": "Adidas Original: Rock the Floor<br />Warsaw, Poland",
    "original": "",
    "description": "In his first tournament after winning BC One, RoxRite was flown to Warsaw for the Adidas Originals Rock the Floor event to battle some up and coming European and Russian talent in a hard-fought competition. In the finals, he went up against Xisco of the Dutch crew Hustle Kidz, showing off his signature precision to the beat of the DJ’s breaks. \"This was another big international title to take home,\" he said. (March 2012)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/079-t.gif",
    "src": "images/artwork-opt/079.gif"
  },
  {
    "id": "89",
    "year": "Sept. 2015",
    "type": "Playlist",
    "video": "",
    "title": "Sept. 2015<br />Renegades 32-Year Anniversary<br />San Francisco, CA",
    "name": "Renegades 32-Year Anniversary<br />San Francisco, CA",
    "original": "",
    "description": "RoxRite's entry at the Renegades' 32nd Anniversary event caused controversy in the scene; he entered with Neguin and Menno on behalf of their BC One All-Star team. \"None of our (Renegades) crew members were judging, that's the only reason I entered,\" he explains. \"I would never enter my own crew anniversary with my crew judging. There's no judges from the Renegades, none of the Renegades are competing, it’s another tournament. It doesn't matter at that point. It was a reason for people to bitch about something.\" If there was any bias at that event, it wasn't from RoxRite's side–and they still won. \"There was a 3 to 2 vote in the end, which was unexpected. But to win by only one vote means that there was a loss.\" (September 2015)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/089-t.gif",
    "src": "images/artwork-opt/089.gif"
  },
  {
    "id": "96",
    "year": "November 2017",
    "type": "video",
    "video": "EGoIfoy7Rs0",
    "title": "November 2017<br />2 on 2<br />Tijuana, MX",
    "name": "2 on 2<br />Tijuana, MX",
    "original": "",
    "description": "\"I had never entered a contest in Mexico,\" RoxRite said. \"I had battled in an exhibition battle in Mexico City before, but not a contest.\" RoxRite’s girlfriend, B-girl Paulina of Polish crew Breaknuts, was visiting him in LA, and the two decided to go to the Sopitas Crew 11th Anniversary jam in Tijuana; on the way there, they decided to enter together. \"We ended up just having a good night of dancing,\" he said, \"not feeling no pressure, enjoying each battle one round at a time.\" The two ended up battling another couple that had entered the competition, visiting from France. \"A lot of events you feel the pressure of needing to do something crazy,\" RoxRite said. \"Here it was [about] letting go and doing what I felt in the moment. For my first battle in Mexico it was a special one.\" (November 2017)\n",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/096-t.gif",
    "src": "images/artwork-opt/096.gif"
  },
  {
    "id": "97",
    "year": "January 2018",
    "type": "video",
    "video": "DRj_Y9awrd0",
    "title": "January 2018<br />Bonnie & Clyde<br />San Diego, CA",
    "name": "Bonnie & Clyde<br />San Diego, CA",
    "original": "",
    "description": "After taking December off, RoxRite and Paulina entered their very first Bonnie & Clyde—a 2 on 2, b-boy/b-girl format competition. At first, RoxRite says, \"Paulina was killing it. I was trying to shake off the rust and get in the zone,\" The couple persevered and squared off against San Diego’s Calamities (Lancer and La Vix) in the finals. \"Lancer, a well respected figure in the San Diego b-boy scene, came after me,\" said RoxRite, \"and definitely pushed me to bring my best out. In turn it was a battle, a super close one at that.\" Winning by just one vote, RoxRite and Paulina took top honors and RoxRite secured his 97th win. \"I always tell people that when you battle, it’s a back and forth attack, you give what you get. That’s how you can tell a battler from a performer. That night they brought the best out of us, just as we did for them.\" (January 2018)\n",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/097-t.gif",
    "src": "images/artwork-opt/097.gif"
  },
  {
    "id": "98",
    "year": "January 2018",
    "type": "video",
    "video": "dLCCDdBdEFQ",
    "title": "January 2018<br />The King of What?<br />Baltimore, MD",
    "name": "The King of What?<br />Baltimore, MD",
    "original": "",
    "description": "\"This was a jam,\" he said, \"a reminder of what my early years of events were like. Strictly cyphers with hip-hop, everyone dancing most of the night.\" RoxRite hadn’t battled in a cypher format in a while—\"I was a bit nervous going into the battle,\" he admitted. He was worried about his stamina and performance. \"In the final,\" he said, \"I wasn't connecting as much as I wanted to.\" RoxRite’s first jam in Baltimore came down to the wire—but he didn’t leave empty handed. He won in another 2-1 decision. \"I was reminded how important it is to fully focus before battles,\" RoxRite said, \"and to not let distractions get in the way of trying ideas one has in mind leading up to each battle.\"\n(January 2018)\n",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/098-t.gif",
    "src": "images/artwork-opt/098.gif"
  },
  {
    "id": "99",
    "year": "January 2018",
    "type": "video",
    "video": "xIATbdvY_Uc",
    "title": "January 2018<br />Undisputed World Finals<br />San Diego, CA",
    "name": "Undisputed World Finals<br />San Diego, CA",
    "original": "",
    "description": "\"This event was the World Finals of Undisputed and I was proud to see it come to San Diego,\" said RoxRite. RoxRite planned to battle with fellow All-Stars Menno and Neguin; when Menno became injured, Victor took his place. RoxRite was also feeling worn down. \"After the two events I did prior,\" RoxRite explained, \"I had a hard time finding time to rest, practice, and host the out of towners.\" The finals found the All-Star squad going up against Bay Area crew Rock Force in a close battle. RoxRite and crew won by a tiebreaker. \"This was another reminder of the importance of playing your role in crew battles,\" RoxRite said. \"You can’t let ego get in the way of the crew; you must play your part and do what is needed.\" (January 2018)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/099-t.gif",
    "src": "images/artwork-opt/099.gif"
  },
]
